Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Выводит информационное сообщение.
en: It shows the information message.

source: Выводит предупреждающее сообщение.
en: It shows the warning message.

source: Выводит сообщение об ошибке в случае, если первый параметр = false.
en: It shows the error message, if the first parameter = false.

source: Выводит сообщение об ошибке.
en: It shows the error message.

source: Выделение 10 клиентов с наибольшими суммами покупок;
en: Selection of 10 clients with the highest purchase sums.

source: Выделение блоков, решающих независимые подзадачи, дает возможность применять их повторно в смежных задачах.
en: Selection of the blocks solving independent subtasks allows for their repeated application in the similar tasks.

source: Выделение можно перемещать с помощью кнопок клавиатуры %kbd Up %, %kbd Down %, %kbd Left %, %kbd Right %.
en: Selection can be moved using the following keyboard keys: %kbd Up %, %kbd Down %, %kbd Left %, %kbd Right %.

source: Выделить корневой узел и с помощью кнопки Добавить дочерний узел добавить дочерний узел
en: Select the root node and add the child node using the following button: Add child node.

source: Выделить необходимое подключение в панели и, вызвав кликом правой кнопки мыши его контекстное меню, воспользоваться одним из предложенных способов (см.
en: Select the required connection in the panel and use one of the specified methods clicking on the right mouse button to open its context menu (refer to

source: Выделить несколько элементов можно удерживая клавишу Shift или Ctrl.
en: It is possible to select several items by holding down the Shift or Ctrl key.

source: Вызвав выпадающее меню нажатием правой кнопки мыши и нажав кнопку Добавить;
en: by calling the drop-down menu using the right mouse button and pressing Add button;

source: Вызвать выпадающее меню нажатием правой кнопки мыши и нажать кнопку Удалить.
en: to call the drop-down menu by pressing the right mouse button and pressing Delete button.

source: Вызовем Мастер настройки (см.
en: Call the Wizard (refer to

source: Выполнение команды "Выполнить узел".
en: Execution of "Run node" command.

source: Выполнение команды "Переобучить узел";
en: Execution of "Retrain node" command;

source: Выполним свертку столбцов.
en: Let's collapse columns.

source: Выполнить преобразование: 11.08.2017 13:50 → любой текст Aug, еще текст 2017, 13.
en: Perform transformation: 11.08.2017 13:50 → any Aug text, another text 2017, 13.

source: Выполняет задачи загрузки, расчетов, построения моделей, визуализации, управления правами и прочее.
en: It completes the loading, calculation, model training, visualisation, right management and other tasks.

source: Выполняются правила замены для значений, не найденных на предыдущих шагах.
en: Replacement rules are observed for the values not found at the previous steps.

source: Выражение - выражение, значение которого поочередно сравнивается со значениями аргументов Значение.
en: Expression - the expression value of which is alternately compared with the values of the Value arguments.

source: Выражение - выражение, значение которого поочередно сравнивается со значениями аргументов ЗначениеN.
en: Expression - the expression value of which is alternately compared with the values of the ValueN arguments.

source: Выражение - любое строковое или числовое выражение.
en: Expression - any string or numeric expression.

source: Выражение - любое числовое выражение, величина которого используется для сравнения.
en: Expression - any numeric expression value of which is used for comparison.

source: Выражение - произвольное строковое выражение.
en: Expression - arbitrary string expression.

source: Выражение - числовое выражение.
en: Expression - numeric expression.

source: Выражение может содержать:
en: Expression can contain the following components:

source: Выражение)
en: Expression)

source: Выставив соответствующие флаги, можно задать:
en: The following parameters can be set by selecting corresponding checkboxes:

source: Выход
en: Output

source: Выход разгруппировки:
en: Ungroup output:

source: Выходная таблица:
en: Output table:

source: Выходное поле обучающего набора данных (данное поле выводится только при обучении нейросети).
en: The output field of the training data set (this field is displayed only when neural network training).

source: Выходное — значения поля будут использоваться как выходные (целевые).
en: Output: the field values will be used as the output ones (target).

source: Выходной набор данных:
en: Output data set:

source: Выходной набор представляет данные, которые порт отдает.
en: The output data set represents the data that is given back by the port.

source: Выходной столбец ID при данной настройке содержит значения идентификаторов.
en: When this setting is selected, ID output column contains the identifier values.

source: Выходной столбец ID содержит целое значение номера записи.
en: ID output column contains the integer value of the record number.

source: Выходные данные подключения используются узлом REST-запрос.
en: The output connection data is used by the REST Request node.

source: Выходные диапазоны
en: Output ranges

source: Выходные порты
en: Output Ports

source: Выходы
en: Outputs

source: Вычисляется на основе используемых в Кубе и области фильтрации измерений и фактов.
en: It is calculated on the basis of the dimensions and measures used in the Cube and filtration area.

source: Вышеуказанные объекты импортируются из встроенного модуля "builtIn/Data".
en: The objects specified above are imported from the built-in module: "builtIn/Data".

source: Выявление активной ветви происходит по следующему принципу:
en: The active branch is detected as follows:

source: Выявленные ассоциативные правила и их показатели: поддержка, достоверность, лифт.
en: Detected association rules and their parameters: support, confidence, lift.

source: Где %ИмяПеременной% — переменная, содержащая любую команду для выполнения в командной строке Windows.
en: Where %VariableName%: the variable that contains any command to be executed on the Windows command line.

source: Где:
en: Where:

source: Где: VAR1 ... VAR5 — имена управляющих переменных, принятые узлом в качестве входных параметров.
en: Where: VAR1 ... VAR5 are the names of the control variables accepted by the node as the input parameters.

source: Генерировать уникальное для каждой версии пакета;
en: Generate unique for each package version;

source: Генерировать уникальное для пакета (используется по умолчанию);
en: Generate unique for package (it is used by default);

source: Герметик
en: Sealer

source: Гистограмма может быть двух видов:
en: There are two types of histograms:

source: Гистограмма;
en: Histogram;

source: Гистограммы
en: Histograms

source: Гистограммы в ячейке таблицы или во вкладке сравнения нормированы по высоте самого высокого столбца.
en: Histograms in the table cell or in the comparison tab are normalized by the height of the highest column.

source: Гистограммы содержат 3 типа столбцов:
en: Histograms contain three types of columns:

source: Главная таблица — Персона, присоединяемая — Город.
en: Main table — A person, joined — A city.

source: Главная таблица:
en: Main table:

source: Главное меню расположено в левой части программного окна и содержит следующие кнопки:
en: The main menu is located in the left part of the application window and contains the following buttons:

source: Главное окно условно можно разделить на 5 областей (см.
en: The main window can be conventionally divided into 5 areas (refer to

source: Глобальный индекс узла - узел отсутствует в древовидной структуре данных, однако он появляется в отображении дерева и указывает на индекс, используемый в узле-массиве.
en: Global node index: the node is absent in the tree-like data structure. However, it appears in the tree view and points to the index used in the array node.

source: Глубина истории.
en: Depth period.

source: Глубина разложения - определяет «масштаб» отсеиваемых деталей: чем больше эта величина, тем более «крупные» детали в исходных данных будут отброшены.
en: Decomposition level defines the "scale" of the filtered out details. The higher this value, the "larger" details will be filtered out in the source data.

source: Год - год в виде числа,
en: Year - year in the form of a number.

source: Графин стеклянный
en: Glass jug

source: Грунтовка
en: Primer

source: Группа параметров Область данных.
en: Data source group of parameters

source: Группа параметров Представление значений:
en: Literals group of parameters:

source: Группа параметров Представление столбцов:
en: Columns View group of parameters:

source: Группа параметров Разделители:
en: Separators group of parameters:

source: Группа параметров Форматы:
en: Formats group of parameters:

source: Группа содержит девять переключателей, каждый из которых вызывает определенную диаграмму в центре визуализатора:
en: The group contains nine switches each of which calls the definite chart in the visualizer center:

source: Группа товаров
en: Group of goods

source: Группировка выполняет действия над набором данных аналогичные действиям SQL-запроса с применением предложения GROUP BY.
en: The grouping enables to perform actions with a data set that are simillar to the SQL request actions using GROUP BY offer.

source: Группы нумеруются слева направо, в порядке появления открывающихся скобок.
en: Groups are numbered from left to right according to occurrence of opening brackets.

source: Груши
en: Pears

source: Да
en: Yes

source: Далее в каждой строке располагается кнопка "рассчитать интервалы" и в шапке таблицы "рассчитать все интервалы".
en: Later on, "calculate bins" button is located in each row, and "calculate all bins" button is located in the table head.

source: Далее выбирается имя поля, отношение сравнения (Условие) и значение сравнения.
en: Then it is required to select the field name, comparison ratio (Condition) and comparison value.

source: Далее отметить галочками нужные методы агрегации.
en: Then, it is required to tick the necessary aggregation methods.

source: Далее с помощью радиокнопки определяется тип идентификаторов:
en: Then it is required to define the type of identifiers using the radio button:

source: Далее эти данные сортируются по убыванию суммы при помощи компонента Сортировка и затем передаются на узел выделения первых 10 строк таблицы.
en: Then this data is sorted in the sum descending order using the Sorting component. Then this data is transferred to the node used for selection of the first 10 table rows.

source: Данная Подмодель также может содержать иерархию Подмоделей и подузлов.
en: This Supernode can also include hierarchy of Supernodes and subnodes.

source: Данная версия платформы предназначена для развертывания во внутренней сети, когда подразумевается работа более чем одного пользователя с различных рабочих мест.
en: This platform version is designated for deployment in the internal network when there is more than one user working from different working places.

source: Данная версия платформы предназначена для установки на локальной машине, когда подразумевается работа одного пользователя.
en: This platform version is designated for installation on the local machine when one user operation is required.

source: Данная вкладка позволяет просмотреть вид SQL-запроса, определяющего структуру таблицы.
en: This tab enables to view the SQL query type defining the table structure.

source: Данная группа параметров влияет на режим активации узла исключительно в пакетном режиме.
en: This group of parameters has an impact on the node activation mode only in the batch mode.

source: Данная кнопка отрывает древовидную структуру Пакета, позволяющую быстро перемещаться по его составным объектам (см.
en: This button enables to open the tree-like Package structure that allows for quick transition across its complex objects (refer to

source: Данная настройка необходима в том случае, когда задан порт Внешние диапазоны квантования, т.е. в узел Конечные классы подается внешнее разбиение в виде таблицы.
en: This option is required when External binning ranges port is set, namely, the external binning is supplied to the Coarse Classes node in the table form.

source: Данная опция доступна в случае установки для всего узла режима кэширования Выбранные поля.
en: This option is available if the Selected fields caching mode is set for the whole node.

source: Данная опция сбрасывается и становится неактивной, когда выбран индикатор Гистограмма.
en: This option is reset and becomes inactive when Histogram indicator is selected.

source: Данная проверка не осуществляется, если параметр имеет значение */*.
en: This test is not performed in the case of the following parameter value:*/*.

source: Данная страница содержит следующие команды для манипуляции с пакетами:
en: This page contains the following commands to use packages:

source: Данное название будет отображаться в легенде диаграммы;
en: This name will be displayed in the chart legend.

source: Данное окно имеет две вкладки:
en: This window has two tabs:

source: Данное подключение так же реализует следующие особенности работы с импортом баз данных.
en: This connection also implements the following features of work with database import.

source: Данное правило не применяется при использовании допустимого интервала (см.
en: This rule is not applied when using the allowable interval (refer to

source: Данное соответствие графически отобразится линией связи.
en: This mapping will be graphically displayed as a link.

source: Данную задачу решает механизм переопределения, позволяющий модифицировать производный компонент только в использующем его сценарии, при этом в библиотеке функций он останется неизменным.
en: This task is solved by the overriding mechanism providing modification of the derived component only in the workflow using it. It will be unchanged in the library of functions.

source: Данную особенность БД ClickHouse следует учитывать при проектировании систем.
en: It is required to take this ClickHouse DB feature into account when designing systems.

source: Данные библиотеки поставляются в составе дистрибутива Loginom.
en: These libraries are included into the Loginom distribution kit.

source: Данные в поле представляют собой числа с плавающей точкой, соответствующие стандарту IEEE 754-2008.
en: The field data represents floating point numbers meeting IEEE 754-2008 standard.

source: Данные во входном порте обработчика представлены в виде входного и выходного наборов.
en: The data in the input port of the handler are represented in the form of input and output data sets.

source: Данные для расчета долей:
en: Data for calculation of quotas:

source: Данные ключевых полей основного и присоединяемого наборов сравниваются между собой, результат операции сравнения используется алгоритмом слияния для формирования результирующего набора.
en: Data of the key fields of the main and joined data sets is compared with each other. The comparison result is used by the join algorithm to generate the resulting data set.

source: Данные могут принимать только два значения True или False
en: The data can take only two values: True or False.

source: Данные настройки содержат информацию о языковых стандартах, форматах представления чисел, времени, даты.
en: These settings contain information on the language standards, number, time, date formats.

source: Данные не сопоставленных полей помещаются в отдельные столбцы результирующего набора, которые можно отметить префиксами.
en: The data of the fields that are not mapped are placed into separate columns of the resulting data set that can be checked using prefixes.

source: Данные перед обработкой узлом попадают в его входной порт, где они могут быть предварительно модифицированы.
en: Before the node processing data is sent to its input port when it can be preliminarily modified.

source: Данные полей в этой группе обрабатываются в соответствии с функциями агрегации.
en: The fields data in this group are processed according to the aggregation functions.

source: Данные поля могут отсутствовать или присутствовать в любом количестве.
en: These fields can be available or not in any amount.

source: Данные представляют собой целые числа в диапазоне от -263 до 263-1
en: The data represents integers in the range from -263 to 263-1

source: Данные третьей группы полей участвуют в расчете фактов — агрегированных значений на пересечении строк и колонок сводной таблицы.
en: Data of the third group of fields is used for calculation of measures — aggregated values at the intersection of strings and columns of the pivot table.

source: Данный визуализатор доступен в любом активном выходном:
en: This visualizer is available in any active output:

source: Данный визуализатор состоит из трех областей:
en: This visualizer consists of three areas:

source: Данный индекс показывает, насколько неравномерно распределены вероятности назначения различных классов набору входных параметров.
en: This index shows the nonuniformity degree of distribution of assignment probabilities of different classes to the input parameters set.

source: Данный метод следует применять, если известно, что распределение данных близко к нормальному.
en: This method can be used if it is known that data distribution is close to the normal one.

source: Данный обработчик предназначен для автоматического заполнения пропущенных значений в наборах данных.
en: The handler is designated for automatic filling of null values in data sets.

source: Данный параметр влияет на режим активации узла как в пакетном режиме, так и в интерактивном.
en: This parameter has an impact on the node activation node both in the batch mode, and in the interactive mode.

source: Данный параметр задается отдельно для выбросов и экстремальных значений.
en: This parameter is set only for outliers and exreme values.

source: Данный режим использует алгоритм шифрования AES256 и предусматривает использование пароля.
en: AES256 encryption is used in this mode, and a password is required.

source: Данный способ квантования доступен при подключении внешних таблиц квантования.
en: This binning method is available when the external binning tables are connected.

source: Данный способ присутствует в настройках, если на входной порт обработчика подаются данные внешней таблицы замен.
en: This method is available in the settings if the external replacement table data is supplied to the input handler port.

source: Данный фактор всегда будет присутствовать в модели.
en: This factor will be always included into the model.

source: Данный формат рекомендован для хранения промежуточных расчетов и увеличения скорости.
en: It is recommended to use this format for storage of intermediate calculations and speed increase.

source: Данный этап становится доступен только при заключении в цикл Подмоделей, имеющих входные и выходные порты для переменных.
en: This step can be available only when looping the Supernodes that have input and output ports for variables.

source: Дата
en: Date

source: Дата (Год + День)
en: Date (Year + Day)

source: Дата (Год)
en: Date (Year)

source: Дата (День месяца)
en: Date (Month day)

source: Дата (Минута)
en: Date (Minute)

source: Дата (Свой формат)
en: Date (Own format)

source: Дата - аргумент типа Дата/Время
en: Date - argument of the Date/Time type.

source: Дата - аргумент типа Дата/Время.
en: Date - argument of the Date/Time type.

source: Дата - выражение типа дата/время.
en: Date - expression of the date/time type.

source: Дата - поле типа дата.
en: Date - the date type field.

source: Дата(исходный столбец)
en: Date(source column)

source: Дата-время.
en: Date-time.

source: Дата/Время функции
en: Function Date/Time

source: Дата1, Дата2 - поля типа дата.
en: Date1, Date2 - the date type fields.

source: Дата\_время - выражение типа дата/время.
en: Date_time - expression of the date/time type.

source: ДатаВремя - поле типа дата/время.
en: DateTime - the date/time type field.

source: Два скрытых слоя.
en: Two hidden layers.

source: Двойная кавычка(");
en: Double quote (")

source: Двойной клик мыши по позиции выбранной функции вставляет ее синтаксис в область кода выражения.
en: Double click on the position of the selected function enables to enter its syntax to the expression code area.

source: Двойной клик мыши по позиции дерева измерений и фактов вводит имя измерения или факта с выбранной функцией агрегации в область ввода выражения.
en: Double click on the position of the dimensions and measures tree enables to enter the dimension or measure name with the selected aggregation function to the expression entry area.

source: Двойной клик мыши по позиции списка вводит имя переменной в область кода выражения.
en: Double click on the list item position enables to enter the variable name to the expression code area.

source: Двойной клик мыши по позиции списка вводит имя поля/переменной в область кода выражения.
en: Double click on the list item position enables to enter the field/variable name to the expression code area.

source: Двойной клик по полю открывает окно "Выбора агрегации".
en: Double click on the field enables to open the "Aggregation selection" window.

source: Двойным кликом по выбранному полю вызывается диалог редактирования его параметров.
en: Double click on the selected field calls the dialog to edit its features.

source: Двойным щелчком левой кнопки мыши по полю;
en: by double click on the field with the left mouse button;

source: Действие параметра аналогично выполнению команды БД "PRAGMA schema.cache_size = pages | -kibibytes;", где при введении положительного числа указывается количество памяти в страницах, а при отрицательного числа выделение памяти в КиБ.
en: The parameter provides the same effect as the DB command does: "PRAGMA schema.cache_size = pages | -kibibytes;". When a positive number is entered, the cache size is specified in pages, and when a negative number is entered, the cache is specified in KiB.

source: Действие параметра аналогично выполнению команды БД "PRAGMA schema.synchronous = 0 | OFF | 1 | NORMAL | 2 | FULL | 3 | EXTRA;" и предусматривает выбор из следующих вариантов.
en: The parameter provides the same effect as the DB command does: "PRAGMA schema.synchronous = 0 | OFF | 1 | NORMAL | 2 | FULL | 3 | EXTRA;", and it allows for one of the following options.

source: Действие параметра аналогично выполнению команды БД: "PRAGMA schema.journal_mode = DELETE | TRUNCATE | PERSIST | MEMORY | WAL;" и предусматривает выбор из следующих вариантов.
en: The parameter provides the same effect as the DB command does: "PRAGMA schema.journal_mode = DELETE | TRUNCATE | PERSIST | MEMORY | WAL;", and it allows for one of the following options.

source: Действие этой опции приводит к автоматическому конфигурированию (настройке) порта, в результате чего выходной набор порта полностью повторяет структуру входного набора.
en: Usage of this option causes the automatic port configuration (setup). In the result, the output data set of the port fully repeats the input data set structure.

source: Действие, выполняемое методом, в Loginom реализуется публикуемым узлом Сценария, а структура входных данных и ответа определяется входными и выходными портами этого узла.
en: The action performed by the method is implemented in Loginom by the published Workflow node, and the structure of the input data and response is defined by the input and output ports of this node.

source: Действия в таблице
en: Actions in the Table

source: Действия над выбранными полями можно осуществлять мышью.
en: It is possible to use the mouse to perform actions with the selected fields.

source: Действия над полями
en: Actions with the Fields

source: Декомпозиция
en: Decomposition
